[
    {
        "username": "lekiwif",
        "post_id": "1",
        "title": "Tempor officiis comm",
        "body": "Below is an example of a basic card with mixed content and a fixed width. Cards have no fixed width to start, so they’ll naturally fill the full width of its parent .",
        "image": "posts-98922.jpg"
    },
    {
        "username": "bidydixy",
        "post_id": "2",
        "title": "Aut magnam culpa ne",
        "body": "Comparing these processes to a real-world example, when you go through security in an airport, you show your ID to authenticate your identity. Then, when",
        "image": "posts-92645.webp"
    },
    {
        "username": "gelumuco",
        "post_id": "3",
        "title": "In mollit aut vitae ",
        "body": "when you arrive at the gate, you present your boarding pass to the flight attendant, so they can authorize you to board your flight and allow access to the plane.",
        "image": "posts-74203.jpg"
    },
    {
        "username": "qykecywo",
        "post_id": "4",
        "title": "Culpa corrupti in a",
        "body": "While often used interchangeably, authentication and authorization represent fundamentally different functions. In this article, we compare and contrast the two",
        "image": "posts-86755.jpg"
    },
    {
        "username": "vunihubum",
        "post_id": "5",
        "title": "Consectetur est est",
        "body": "Cards are built with as little markup and styles as possible, but still manage to deliver a ton of control and customization. Built with flexbox, they offer easy alignment and mix well",
        "image": "posts-5302.webp"
    },
    {
        "username": "hozowine",
        "post_id": "6",
        "title": "Saepe voluptas ipsa",
        "body": "A card is a flexible and extensible content container. It includes options for headers and footers, a wide variety of content, contextual background colors, and powerful",
        "image": "posts-32132.webp"
    },
    {
        "username": "xigikiwem",
        "post_id": "7",
        "title": "Ex sit fugiat dolo",
        "body": "powerful display options. If you’re familiar with Bootstrap 3, cards replace our old panels, wells, and thumbnails. Similar functionality to those components is available as",
        "image": "posts-91160.webp"
    },
    {
        "username": "rodyho",
        "post_id": "8",
        "title": "Eius similique ut po",
        "body": "We noticed you haven't subscribed to receive the latest jobs for your chosen categories by weekly email. To make sure you don't miss out on your dream job please sign up today.",
        "image": "posts-72757.webp"
    },
    {
        "username": "tazuwigulu",
        "post_id": "9",
        "title": "Dolore occaecat cupi",
        "body": "Copyright ©2025, Mubasher for Securities and Bonds, Egyptian Joint Stock Company, ALL RIGHTS RESERVED. No part or excerpt of this document.",
        "image": "posts-75812.jpg"
    },
    {
        "username": "user1",
        "post_id": 10,
        "title": "Mollit totam enim al",
        "body": "Libero vero totam enimnulla abLibero verototam enim nulla abLibero vertotam enimo nulla abLibero vero totam enimnulla abLibero verototam enim nulla abLibero vertotam enimo nulla ab",
        "image": "posts-93215.webp"
    },
    {
        "username": "user1",
        "post_id": 11,
        "title": "Get started with Bootstrap",
        "body": "Bootstrap is a powerful, feature-packed frontend toolkit. Build anything—from prototype to production—in minutes.Bootstrap is a powerful, feature-packed frontend toolkit. Build anything—from prototype to production—in minutes.",
        "image": "posts-69240.webp"
    },
    {
        "username": "Nouray",
        "post_id": 12,
        "title": "JS components",
        "body": "Curious which components explicitly require our JavaScript and Popper? If you’re at all unsure about the general page structure, keep reading for an example page template.\r\nAccordions for extending our Collapse plugin",
        "image": "posts-10346.jpeg"
    }
]